/*
Створіть веб-додаток для визначення купе в плацкартному вагоні за номером квитка. 
Користувач вводить номер місця, вивести йому номер купе, тип місця - бічне чи ні, верхнє чи нижнє. 
*/

// Отже, ми будемо мати на разі 1 вагон. З кількістю місць - 54.
// Зробимо цей скрипт за допомогою if else.

let myPlace = prompt('Введіть номер місця');

const compartment = {
    1: [1, 2, 3, 4],
    2: [5, 6, 7, 8],
    3: [9, 10, 11, 12],
    4: [13, 14, 15, 16],
    5: [17, 18, 19, 20],
    6: [21, 22, 23, 24],
    7: [25, 26, 27, 28],
    8: [29, 30, 31, 32],
    9: [33, 34, 35, 36]
}

if (myPlace >= 1 && myPlace <= 36) {
    for (let key in compartment) {
        if (compartment[key].includes(parseInt(myPlace))) {
            compartmentKey = key;
            if (myPlace % 2 !== 0) {
                alert(`Ваше місце в купе номер ${key}. Нижня поличка.`)
            } else {
                alert(`Ваше місце в купер під номером ${key}. Верхня поличка`);
            }
        }
    }
} else if (myPlace >= 37 && myPlace <= 54) {
    if (myPlace % 2 !== 0) {
        alert('Ваше місце бічне, нижнє.')
    } else {
        alert('Ваше місце бічне, верхнє.')
    }
} else {
    alert('Введіть місце від 1 до 54')
}